Repository: AmnaAshraf-2/fyp-1
Catalog: lib/l10n/app_*.arb
Languages: ps, ur

# chooseRole
source: Choose your role
ps: خپل رول وټاکئ
ur: اپنا کردار منتخب کریں

source: Customer
ps: پیرودونکی
ur: صارف

source: Driver
ps: چلونکی
ur: ڈرائیور

source: Enterprise
ps: سازمان
ur: ادارہ

# dashboardTitle
source: Customer Dashboard
ps: د پیرودونکي ډشبورډ
ur: کسٹمر ڈیش بورڈ

source: New Bookings
ps: نوې بکینګونه
ur: نئی بکنگز

source: Live Trip
ps: ژوندی سفر
ur: چالو سفر

source: Upcoming Bookings
ps: راتلونکي بکینګونه
ur: آنے والی بکنگز

source: Past Bookings
ps: تېر بکینګونه
ur: گزشتہ بکنگز

source: Welcome
ps: ښه راغلاست
ur: خوش آمدید

# selectVehicle
source: Select a Vehicle
ps: موټر انتخاب کړئ
ur: گاڑی منتخب کریں

source: Cargo Details
ps: د کارګو تفصیلات
ur: کارگو کی تفصیلات

source: Load Name
ps: د سامان نوم
ur: سامان کا نام

# loadDimensions
source: Load Dimensions (optional)
ps: د سامان اندازه (اختیاري)
ur: سامان کے ابعاد (اختیاری)

source: Quantity of Vehicles
ps: د موټرو شمېر
ur: گاڑیوں کی تعداد

# offerFare
source: Your Offer Fare (Rs)
ps: ستاسو وړاندیز شوې کرایه (روپۍ)
ur: آپ کی پیشکش (روپے)

source: Continue to Summary
ps: خلاصې ته دوام ورکړئ
ur: خلاصے پر جائیں

source: Required
ps: اړین دی
ur: ضروری ہے

source: Load Weight
ps: د بار وزن
ur: سامان کا وزن

source: Unit
ps: یونټ
ur: یونٹ

source: Load Type
ps: د سامان ډول
ur: سامان کی قسم

source: Fragile
ps: نازک
ur: نازک

source: Heavy
ps: دروند
ur: بھاری

source: Perishable
ps: ژر خرابېدونکی
ur: جلد خراب ہونے والا

source: General Goods
ps: عمومي توکي
ur: عام سامان

source: Pickup Time: Not selected
ps: د اخیستلو وخت: نه دی ټاکل شوی
ur: اٹھانے کا وقت: منتخب نہیں کیا گیا

source: Pickup Time
ps: د رااخیستلو وخت
ur: پک اپ کا وقت

source: Select Time
ps: وخت وټاکئ
ur: وقت منتخب کریں

# cargoInsured
source: Your Cargo is Insured
ps: ستاسو کارګو بیمه شوی دی
ur: آپ کا کارگو بیمہ شدہ ہے

# insuredPolicy
source: Insured shipments are covered up to Rs. 500,000. Claims must be filed within 7 days of delivery.
ps: بیمه شوي سامان تر 500,000 روپیو پورې پوښل کېږي. دعوې باید د سپارلو له 7 ورځو دننه وشي.
ur: بیمہ شدہ سامان کی زیادہ سے زیادہ رقم 5,00,000 روپے تک ہے۔ دعوے ترسیل کے 7 دن کے اندر جمع کروائے جائیں۔

# uninsuredPolicy
source: Uninsured shipments are transported at owner's risk. The company is not liable for any damages.
ps: بې بیمې سامان د مالک په خطر لیږدول کېږي. شرکت د زیان مسؤلیت نه لري.
ur: غیر بیمہ شدہ سامان مالک کے خطرے پر منتقل کیا جاتا ہے۔ کمپنی کسی نقصان کی ذمہ دار نہیں۔

# agreeTerms
source: I agree to the terms and conditions
ps: زه له شرایطو او ضوابطو سره موافق یم
ur: میں شرائط و ضوابط سے اتفاق کرتا ہوں

# pleaseAgree
source: Please agree to the terms
ps: مهرباني وکړئ له شرایطو سره موافق شئ
ur: براہ کرم شرائط سے اتفاق کریں

# invalidValues
source: Invalid numeric values
ps: ناسم عددي ارزښتونه
ur: غلط عددی اقدار

# summaryTitle
source: Booking Summary
ps: د بکینګ لنډیز
ur: بکنگ کا خلاصہ

source: Edit All Details
ps: ټولې جزیات سم کړئ
ur: تمام تفصیلات میں ترمیم کریں

source: Quantity
ps: شمېر
ur: مقدار

source: Offered Fare
ps: وړاندیز شوی کرایه
ur: پیش کردہ کرایہ

source: Insurance Status
ps: د بیمې حالت
ur: انشورنس کی حالت

source: Insured
ps: بیمه شوی
ur: بیمہ شدہ

source: Uninsured
ps: بې بیمې
ur: غیر بیمہ شدہ

source: Not selected
ps: نه دی ټاکل شوی
ur: منتخب نہیں کیا گیا

source: Terms Agreement
ps: د شرایطو موافقه
ur: شرائط کی منظوری

source: Insured Policy Accepted
ps: د بیمې تګلاره منل شوې
ur: بیمہ شدہ پالیسی منظور کی گئی

source: Uninsured Policy Accepted
ps: بې بیمې تګلاره منل شوې
ur: غیر بیمہ شدہ پالیسی منظور کی گئی

source: Send Request
ps: درخواست واستوئ
ur: درخواست بھیجیں

# requestSent
source: Request sent to drivers!
ps: درخواست چلوونکو ته واستول شو!
ur: درخواست ڈرائیورز کو بھیج دی گئی!

# pleaseLogin
source: Please log in first
ps: مهرباني وکړئ لومړی ننوتل وکړئ
ur: براہ کرم پہلے لاگ ان کریں

source: Error sending request:
ps: درخواست استولو کې تېروتنه:
ur: درخواست بھیجنے میں خرابی:

# newOffersTitle
source: New Offers
ps: نوې وړاندیزونه
ur: نئی آفرز

# loginAsDriver
source: Please log in as a driver
ps: مهرباني وکړئ د ډرایور په توګه ننوتل وکړئ
ur: براہ کرم بطور ڈرائیور لاگ ان کریں

# noNewOffers
source: No new offers available
ps: هیڅ نوي وړاندیزونه نشته
ur: کوئی نئی آفر دستیاب نہیں

source: Load
ps: مال
ur: سامان

source: Type
ps: ډول
ur: قسم

source: Weight
ps: وزن
ur: وزن

source: Fare Offered
ps: د کرایې وړاندیز
ur: پیش کی گئی کرایہ

source: Insurance
ps: بیمه
ur: انشورنس

source: Yes
ps: هو
ur: ہاں

source: No
ps: نه
ur: نہیں

source: Accept
ps: منل
ur: قبول کریں

source: Reject
ps: ردول
ur: مسترد کریں

source: Offer Accepted
ps: وړاندیز ومنل شو!
ur: آفر قبول کر لی گئی!

source: Offer Rejected
ps: وړاندیز رد شو.
ur: آفر مسترد کر دی گئی۔

source: Error occurred:
ps: تېروتنه رامنځته شوه:
ur: خرابی پیش آئی:

source: New Offers
ps: نوې وړاندیزونه
ur: نئی آفرز

# driverRegStep2
source: Driver Registration - Step 2
ps: د چلوونکي ثبتول - دوهم پړاو
ur: ڈرائیور رجسٹریشن - مرحلہ 2

source: Vehicle Make & Model
ps: د موټر جوړښت او ماډل
ur: گاڑی کا ماڈل اور کمپنی

source: Enter Vehicle Make & Model
ps: د موټر ماډل ولیکئ
ur: گاڑی کا ماڈل درج کریں

source: Vehicle Type
ps: د موټر ډول
ur: گاڑی کی قسم

source: Select Vehicle Type
ps: د موټر ډول وټاکئ
ur: گاڑی کی قسم منتخب کریں

source: Vehicle Color
ps: د موټر رنګ
ur: گاڑی کا رنگ

source: Enter Vehicle Color
ps: د موټر رنګ ولیکئ
ur: گاڑی کا رنگ درج کریں

source: Engine Number
ps: د انجن نمبر
ur: انجن نمبر

source: Enter Engine Number
ps: د انجن نمبر ولیکئ
ur: انجن نمبر درج کریں

source: Chassis Number
ps: چیسس نمبر
ur: چیسس نمبر

source: Enter Chassis Number
ps: چیسس نمبر ولیکئ
ur: چیسس نمبر درج کریں

# regExpiry
source: Registration Expiry Date
ps: د ثبت موده پای ته رسېدلې نیټه
ur: رجسٹریشن کی معیاد ختم ہونے کی تاریخ

# selectRegExpiry
source: Select Registration Expiry
ps: د ثبت نیټه وټاکئ
ur: رجسٹریشن کی تاریخ منتخب کریں

source: Vehicle Insurance
ps: د موټر بیمه
ur: گاڑی کی انشورنس

source: Insurance Validity
ps: د بیمې موده
ur: انشورنس کی معیاد

# fitnessCertificate
source: Fitness Certificate (if applicable)
ps: د فټنس سند (که اړین وي)
ur: فٹنس سرٹیفیکیٹ (اگر لاگو ہو)

# fitnessCertNumber
source: Fitness Certificate Number
ps: د فټنس سند شمېره
ur: فٹنس سرٹیفیکیٹ نمبر

# trackingId
source: Vehicle Tracking Device ID (optional)
ps: د موټر د تعقیب آلې شمېره (اختیاري)
ur: گاڑی کا ٹریکنگ ڈیوائس آئی ڈی (اختیاری)

source: Submit Registration
ps: ثبتول وسپارئ
ur: رجسٹریشن جمع کروائیں

# vehicleInfoSaved
source: Vehicle info saved successfully
ps: د موټر معلومات په بریالیتوب سره خوندي شول
ur: گاڑی کی معلومات کامیابی سے محفوظ ہو گئیں

# vehicleInfoError
source: Error saving vehicle info
ps: د موټر معلوماتو خوندي کولو کې تېروتنه
ur: گاڑی کی معلومات محفوظ کرنے میں خرابی

source: Vehicle Name
ps: د موټر نوم
ur: گاڑی کا نام

source: Vehicle Capacity
ps: د موټر ظرفیت
ur: گاڑی کی گنجائش

source: Pickup Carry
ps: پک اپ کیری
ur: پک اپ کیری

# pickupCarryCapacity
source: Up to 800kg
ps: تر 800 کیلوګرامه
ur: 800 کلوگرام تک

source: Shehzore
ps: شهزور
ur: شہزور

# shehzoreCapacity
source: Up to 1200kg
ps: تر 1200 کیلوګرامه
ur: 1200 کلوگرام تک

source: Mazda Truck (Open Body)
ps: مزدا ټرک (خلاصه بدن)
ur: مزدا ٹرک (کھلا باڈی)

# mazdaTruckOpenBodyCapacity
source: Up to 2000kg
ps: تر 2000 کیلوګرامه
ur: 2000 کلوگرام تک

source: Mazda Truck (Close Body)
ps: مزدا ټرک (تړلی بدن)
ur: مزدا ٹرک (بند باڈی)

# mazdaTruckCloseBodyCapacity
source: Up to 2000kg
ps: تر 2000 کیلوګرامه
ur: 2000 کلوگرام تک

source: Vehicle Carrier
ps: د موټرو لیونکی
ur: گاڑی کیریئر

# vehicleCarrierCapacity
source: Up to 10 Vehicles
ps: تر 10 موټرو
ur: 10 گاڑیاں تک

source: Container Truck (20 ft)
ps: د کنټینر ټرک (20 فټه)
ur: کنٹینر ٹرک (20 فٹ)

# containerTruck20ftCapacity
source: Up to 24,000kg
ps: تر 24,000 کیلوګرامه
ur: 24,000 کلوگرام تک

source: Container Truck (40 ft)
ps: د کنټینر ټرک (40 فټه)
ur: کنٹینر ٹرک (40 فٹ)

# containerTruck40ftCapacity
source: Up to 32,000kg
ps: تر 32,000 کیلوګرامه
ur: 32,000 کلوگرام تک

source: Oil Tanker
ps: د تیلو ټانکر
ur: تیل ٹینکر

# oilTankerCapacity
source: Up to 30,000 liters
ps: تر 30,000 لیتره
ur: 30,000 لیٹر تک

source: Reefer Carrier
ps: د سړولو لیونکی
ur: ریفریئر کیریئر

# reeferCarrierCapacity
source: Up to 5000kg (for perishable goods)
ps: تر 5000 کیلوګرامه (د خرابیدونکو توکو لپاره)
ur: 5000 کلوگرام تک (خراب ہونے والے سامان کے لیے)

# reeferCarrierLarge
source: Reefer Carrier
ps: د سړولو لیونکی
ur: ریفریئر کیریئر

# reeferCarrierLargeCapacity
source: Up to 35,000kg (for perishable goods)
ps: تر 35,000 کیلوګرامه (د خرابیدونکو توکو لپاره)
ur: 35,000 کلوگرام تک (خراب ہونے والے سامان کے لیے)

source: Mini Loader Rickshaw
ps: د کوچني لوډر رکشه
ur: منی لوڈر رکشہ

# miniLoaderRickshawCapacity
source: Up to 500kg
ps: تر 500 کیلوګرامه
ur: 500 کلوگرام تک

source: Flatbed Truck
ps: د فلیټ بیډ ټرک
ur: فلیٹ بیڈ ٹرک

# flatbedTruckCapacity1
source: Up to 10,000kg
ps: تر 10,000 کیلوګرامه
ur: 10,000 کلوگرام تک

# flatbedTruckCapacity2
source: Up to 6,000kg
ps: تر 6,000 کیلوګرامه
ur: 6,000 کلوگرام تک

# flatbedTruckCapacity3
source: Up to 16,000kg
ps: تر 16,000 کیلوګرامه
ur: 16,000 کلوگرام تک

# flatbedTruckCapacity4
source: Up to 35,000kg
ps: تر 35,000 کیلوګرامه
ur: 35,000 کلوگرام تک

source: Dumper
ps: ډمپر
ur: ڈمپر

# dumperCapacity
source: Up to 25,000kg
ps: تر 25,000 کیلوګرامه
ur: 25,000 کلوگرام تک

source: Profile
ps: پروفایل
ur: پروفائل

source: Settings
ps: تنظیمات
ur: ترتیبات

source: Support / Help
ps: ملاتړ / مرسته
ur: سپورٹ / مدد

source: About
ps: د اړوند
ur: کے بارے میں

source: History/Past Trips
ps: تاریخ/تیر سفرونه
ur: تاریخ/گزشتہ سفر

source: Logout
ps: وتل
ur: لاگ آؤٹ

source: Switch Role
ps: رول بدل کړئ
ur: کردار تبدیل کریں

source: Dashboard
ps: ډشبورډ
ur: ڈیش بورڈ

source: Booking History
ps: د بکینګ تاریخ
ur: بکنگ کی تاریخ

source: Premium Member
ps: پریمیم غړی
ur: پریمیم ممبر

source: Version
ps: ورژن
ur: ورژن

source: Language
ps: ژبه
ur: زبان

source: Change Language
ps: ژبه بدل کړئ
ur: زبان تبدیل کریں

source: Select Language
ps: ژبه وټاکئ
ur: زبان منتخب کریں

source: English
ps: انګلیسي
ur: انگریزی

source: Proceed
ps: دوام ورکړئ
ur: آگے بڑھیں

source: Forgot Password
ps: پټنوم هیر شو
ur: پاس ورڈ بھول گئے

# enterEmailReset
source: Enter your email to reset your password:
ps: د خپل پټنوم د بیا تنظیم لپاره خپل بریښنالیک ولیکئ:
ur: اپنا پاس ورڈ ری سیٹ کرنے کے لیے اپنا ای میل درج کریں:

source: Email
ps: بریښنالیک
ur: ای میل

source: Email Address
ps: بریښنالیک پته
ur: ای میل ایڈریس

# pleaseEnterValidEmail
source: Please enter a valid email address
ps: مهرباني وکړئ سمه بریښنالیک پته ولیکئ
ur: براہ کرم درست ای میل ایڈریس درج کریں

source: Reset Password
ps: پټنوم بیا تنظیم کړئ
ur: پاس ورڈ ری سیٹ کریں

source: Send Reset Email
ps: د بیا تنظیم بریښنالیک واستوئ
ur: ری سیٹ ای میل بھیجیں

# verifyPhoneSetPassword
source: Verify your phone to set a new password:
ps: د نوي پټنوم د ټاکلو لپاره خپل تلیفون تصدیق کړئ:
ur: نیا پاس ورڈ سیٹ کرنے کے لیے اپنا فون تصدیق کریں:

source: Phone Number
ps: د تلیفون شمیره
ur: فون نمبر

source: Send Code
ps: کوډ واستوئ
ur: کوڈ بھیجیں

source: Sending...
ps: استول کېږي...
ur: بھیجا جا رہا ہے...

source: Enter SMS Code
ps: د SMS کوډ ولیکئ
ur: SMS کوڈ درج کریں

source: Verify Code
ps: کوډ تصدیق کړئ
ur: کوڈ تصدیق کریں

source: Verifying...
ps: تصدیق کېږي...
ur: تصدیق ہو رہی ہے...

source: Set new password
ps: نوی پټنوم ټاکئ
ur: نیا پاس ورڈ سیٹ کریں

source: New Password
ps: نوی پټنوم
ur: نیا پاس ورڈ

source: Confirm Password
ps: د پټنوم تصدیق
ur: پاس ورڈ کی تصدیق کریں

source: Update Password
ps: پټنوم تازه کړئ
ur: پاس ورڈ اپ ڈیٹ کریں

source: Password reset email sent.
ps: د پټنوم د بیا تنظیم بریښنالیک واستول شو.
ur: پاس ورڈ ری سیٹ ای میل بھیج دی گئی۔

# codeSentCheckSms
source: Code sent. Please check your SMS.
ps: کوډ واستول شو. مهرباني وکړئ خپل SMS وګورئ.
ur: کوڈ بھیج دیا گیا۔ براہ کرم اپنا SMS چیک کریں۔

# phoneVerifiedSetPassword
source: Phone verified. You can set a new password.
ps: تلیفون تصدیق شو. تاسو کولی شئ نوی پټنوم ټاکئ.
ur: فون تصدیق ہو گیا۔ آپ نیا پاس ورڈ سیٹ کر سکتے ہیں۔

source: Password updated successfully.
ps: پټنوم په بریالیتوب سره تازه شو.
ur: پاس ورڈ کامیابی سے اپ ڈیٹ ہو گیا۔

# pleaseEnterEmail
source: Please enter your email.
ps: مهرباني وکړئ خپل بریښنالیک ولیکئ.
ur: براہ کرم اپنا ای میل درج کریں۔

# pleaseEnterPhone
source: Please enter your phone number.
ps: مهرباني وکړئ خپله د تلیفون شمېره ولیکئ.
ur: براہ کرم اپنا فون نمبر درج کریں۔

# pleaseEnterSmsCode
source: Please enter the SMS code.
ps: مهرباني وکړئ د SMS کوډ ولیکئ.
ur: براہ کرم SMS کوڈ درج کریں۔

# pleaseVerifyPhoneFirst
source: Please verify your phone first.
ps: مهرباني وکړئ لومړی خپل تلیفون تصدیق کړئ.
ur: براہ کرم پہلے اپنا فون تصدیق کریں۔

source: Please fill both password fields.
ps: مهرباني وکړئ دواړه د پټنوم ساحې ډک کړئ.
ur: براہ کرم دونوں پاس ورڈ فیلڈ بھریں۔

source: Password must be at least 6 characters.
ps: پټنوم باید لږ تر لږه 6 توري ولري.
ur: پاس ورڈ کم از کم 6 حروف کا ہونا چاہیے۔

source: Passwords do not match.
ps: پټنومونه سره سمون نلري.
ur: پاس ورڈ میل نہیں کھاتے۔

# noUserSignedIn
source: No user is signed in. Verify phone again.
ps: هیڅ کارونکی ننوتلی نه دی. د تلیفون بیا تصدیق وکړئ.
ur: کوئی صارف سائن ان نہیں ہے۔ دوبارہ فون تصدیق کریں۔

source: Failed to update password
ps: د پټنوم د تازه کولو کې ناکامي
ur: پاس ورڈ اپ ڈیٹ کرنے میں ناکامی

source: Invalid code
ps: غلط کوډ
ur: غلط کوڈ

source: Verification failed
ps: تصدیق ناکام
ur: تصدیق ناکام

source: Enterprise Details
ps: د سوداګرۍ تفصیلات
ur: انٹرپرائز کی تفصیلات

source: Enterprise Registration
ps: د سوداګرۍ ثبت
ur: انٹرپرائز رجسٹریشن

# enterpriseDetailsDesc
source: Please provide your enterprise information to complete registration
ps: د ثبت بشپړولو لپاره خپل د سوداګرۍ معلومات ورکړئ
ur: رجسٹریشن مکمل کرنے کے لیے اپنی انٹرپرائز کی معلومات فراہم کریں

source: Enterprise Information
ps: د سوداګرۍ معلومات
ur: انٹرپرائز کی معلومات

source: Enterprise Name
ps: د سوداګرۍ نوم
ur: انٹرپرائز کا نام

# enterpriseNameHint
source: Enter your enterprise name
ps: خپل د سوداګرۍ نوم ولیکئ
ur: اپنے انٹرپرائز کا نام درج کریں

source: Please enter enterprise name
ps: مهرباني وکړئ د سوداګرۍ نوم ولیکئ
ur: براہ کرم انٹرپرائز کا نام درج کریں

# enterpriseNameTooShort
source: Enterprise name must be at least 3 characters
ps: د سوداګرۍ نوم باید لږ تر لږه 3 توري ولري
ur: انٹرپرائز کا نام کم از کم 3 حروف کا ہونا چاہیے

source: Registration Number
ps: د ثبت شمیره
ur: رجسٹریشن نمبر

source: Please enter registration number
ps: مهرباني وکړئ د ثبت شمیره ولیکئ
ur: براہ کرم رجسٹریشن نمبر درج کریں

# registrationNumberTooShort
source: Registration number must be at least 8 characters
ps: د ثبت شمیره باید لږ تر لږه 8 توري ولري
ur: رجسٹریشن نمبر کم از کم 8 حروف کا ہونا چاہیے

source: NTN Number
ps: NTN شمیره
ur: NTN نمبر

source: Please enter NTN number
ps: مهرباني وکړئ NTN شمیره ولیکئ
ur: براہ کرم NTN نمبر درج کریں

# ntnNumberTooShort
source: NTN number must be at least 9 characters
ps: NTN شمیره باید لږ تر لږه 9 توري ولري
ur: NTN نمبر کم از کم 9 حروف کا ہونا چاہیے

source: Cooperate Number
ps: د همکاري شمیره
ur: کوآپریٹ نمبر

# cooperateNumberHint
source: Enter cooperate number
ps: د همکاري شمیره ولیکئ
ur: کوآپریٹ نمبر درج کریں

source: Please enter cooperate number
ps: مهرباني وکړئ د همکاري شمیره ولیکئ
ur: براہ کرم کوآپریٹ نمبر درج کریں

source: Business Type
ps: د سوداګرۍ ډول
ur: کاروبار کی قسم

source: Please select business type
ps: مهرباني وکړئ د سوداګرۍ ډول وټاکئ
ur: براہ کرم کاروبار کی قسم منتخب کریں

source: Business Address
ps: د سوداګرۍ پته
ur: کاروباری پتہ

# businessAddressHint
source: Enter complete business address
ps: بشپړه د سوداګرۍ پته ولیکئ
ur: مکمل کاروباری پتہ درج کریں

source: Please enter business address
ps: مهرباني وکړئ د سوداګرۍ پته ولیکئ
ur: براہ کرم کاروباری پتہ درج کریں

source: City
ps: ښار
ur: شہر

source: Please enter city
ps: مهرباني وکړئ ښار ولیکئ
ur: براہ کرم شہر درج کریں

source: Province
ps: ولایت
ur: صوبہ

source: Please enter province
ps: مهرباني وکړئ ولایت ولیکئ
ur: براہ کرم صوبہ درج کریں

source: Postal Code
ps: د پوستې کوډ
ur: پوسٹل کوڈ

source: Please enter postal code
ps: مهرباني وکړئ د پوستې کوډ ولیکئ
ur: براہ کرم پوسٹل کوڈ درج کریں

source: Contact Information
ps: د اړیکو معلومات
ur: رابطے کی معلومات

source: Contact Person
ps: د اړیکو کس
ur: رابطہ شخص

# contactPersonHint
source: Enter contact person name
ps: د اړیکو کس نوم ولیکئ
ur: رابطہ شخص کا نام درج کریں

source: Please enter contact person
ps: مهرباني وکړئ د اړیکو کس ولیکئ
ur: براہ کرم رابطہ شخص درج کریں

source: Contact Phone
ps: د اړیکو تلیفون
ur: رابطہ فون

source: Please enter contact phone
ps: مهرباني وکړئ د اړیکو تلیفون ولیکئ
ur: براہ کرم رابطہ فون درج کریں

source: Website
ps: وېب پاڼه
ur: ویب سائٹ

source: Optional
ps: اختیاري
ur: اختیاری

source: Continue to Shareholders
ps: د ونډه لرونکو ته لاړ شئ
ur: شیئر ہولڈرز کی طرف جائیں

source: Shareholder Details
ps: د ونډه لرونکو تفصیلات
ur: شیئر ہولڈرز کی تفصیلات

# shareholderDetailsDesc
source: Add shareholders and their details
ps: ونډه لرونکي او د دوی تفصیلات اضافه کړئ
ur: شیئر ہولڈرز اور ان کی تفصیلات شامل کریں

source: Add Shareholder
ps: ونډه لرونکی اضافه کړئ
ur: شیئر ہولڈر شامل کریں

source: Shareholder Name
ps: د ونډه لرونکي نوم
ur: شیئر ہولڈر کا نام

# shareholderNameHint
source: Enter shareholder name
ps: د ونډه لرونکي نوم ولیکئ
ur: شیئر ہولڈر کا نام درج کریں

source: Please enter shareholder name
ps: مهرباني وکړئ د ونډه لرونکي نوم ولیکئ
ur: براہ کرم شیئر ہولڈر کا نام درج کریں

# shareholderNameTooShort
source: Shareholder name must be at least 2 characters
ps: د ونډه لرونکي نوم باید لږ تر لږه 2 توري ولري
ur: شیئر ہولڈر کا نام کم از کم 2 حروف کا ہونا چاہیے

source: CNIC
ps: د پیژندنې کارت
ur: شناختی کارڈ

source: Please enter CNIC
ps: مهرباني وکړئ د پیژندنې کارت ولیکئ
ur: براہ کرم شناختی کارڈ درج کریں

# cnicTooShort
source: CNIC must be 15 characters
ps: د پیژندنې کارت باید 15 توري ولري
ur: شناختی کارڈ 15 حروف کا ہونا چاہیے

source: Please enter phone number
ps: مهرباني وکړئ د تلیفون شمیره ولیکئ
ur: براہ کرم فون نمبر درج کریں

source: Address
ps: پته
ur: پتہ

# addressHint
source: Enter complete address
ps: بشپړه پته ولیکئ
ur: مکمل پتہ درج کریں

source: Please enter address
ps: مهرباني وکړئ پته ولیکئ
ur: براہ کرم پتہ درج کریں

source: Share Percentage
ps: د ونډې سلنه
ur: شیئر فیصد

source: Please enter share percentage
ps: مهرباني وکړئ د ونډې سلنه ولیکئ
ur: براہ کرم شیئر فیصد درج کریں

# sharePercentageInvalid
source: Share percentage must be between 0 and 100
ps: د ونډې سلنه باید د 0 او 100 تر منځ وي
ur: شیئر فیصد 0 اور 100 کے درمیان ہونا چاہیے

source: Designation
ps: دنده
ur: عہدہ

source: Please select designation
ps: مهرباني وکړئ دنده وټاکئ
ur: براہ کرم عہدہ منتخب کریں

# shareholderAdded
source: Shareholder added successfully
ps: ونډه لرونکی په بریالیتوب سره اضافه شو
ur: شیئر ہولڈر کامیابی سے شامل ہو گیا

source: Shareholders List
ps: د ونډه لرونکو لیست
ur: شیئر ہولڈرز کی فہرست

source: Total Share Percentage
ps: ټوله د ونډې سلنه
ur: کل شیئر فیصد

source: Please add at least one shareholder
ps: مهرباني وکړئ لږ تر لږه یو ونډه لرونکی اضافه کړئ
ur: براہ کرم کم از کم ایک شیئر ہولڈر شامل کریں

# totalSharePercentageExceeded
source: Total share percentage cannot exceed 100%
ps: ټوله د ونډې سلنه نشي کولی د 100% څخه زیاته شي
ur: کل شیئر فیصد 100% سے زیادہ نہیں ہو سکتا

# enterpriseRegistrationComplete
source: Enterprise registration completed successfully
ps: د سوداګرۍ ثبت په بریالیتوب سره بشپړ شو
ur: انٹرپرائز رجسٹریشن کامیابی سے مکمل ہو گئی

source: Complete Registration
ps: ثبت بشپړ کړئ
ur: رجسٹریشن مکمل کریں

source: Enterprise Dashboard
ps: د سوداګرۍ ډشبورډ
ur: انٹرپرائز ڈیش بورڈ

source: No upcoming bookings
ps: هیڅ راتلونکي حجره نشته
ur: کوئی آنے والی بکنگ نہیں

source: Find New Driver
ps: نوی چلوونکی ومومئ
ur: نیا ڈرائیور تلاش کریں

# areYouSureFindNewDriver
source: Are you sure you want to find a new driver for this request?
ps: ایا تاسو واقعیا د دې غوښتنې لپاره نوی چلوونکی موندل غواړئ؟
ur: کیا آپ واقعی اس درخواست کے لیے نیا ڈرائیور تلاش کرنا چاہتے ہیں؟

# customerCancelledToFindNewDriver
source: Customer cancelled the request to find a new driver
ps: پیرودونکي د نوی چلوونکی موندلو لپاره غوښتنه لغوه کړه
ur: کسٹمر نے نیا ڈرائیور تلاش کرنے کے لیے درخواست منسوخ کر دی

source: Finding new driver...
ps: نوی چلوونکی موندل کېږي...
ur: نیا ڈرائیور تلاش کیا جا رہا ہے...

# cannotMakeCall
source: Cannot make call to {phoneNumber}
ps: د {phoneNumber} ته کال نشي کولی
ur: {phoneNumber} پر کال نہیں کر سکتے

source: Sender Phone Number
ps: د لېږدونکي تلیفون شمیره
ur: بھیجنے والے کا فون نمبر

source: Receiver Phone Number
ps: د ترلاسه کوونکي تلیفون شمیره
ur: وصول کنندہ کا فون نمبر

source: Pickup Location
ps: د رااخیستلو ځای
ur: پک اپ لوکیشن

source: Destination Location
ps: د منزل ځای
ur: منزل کا مقام

source: Guest Driver
ps: مېلمه چلوونکی
ur: مہمان ڈرائیور

source: Upcoming Trips
ps: راتلونکي سفرونه
ur: آنے والے سفر

source: Past Trips
ps: تېر سفرونه
ur: گزشتہ سفر

source: Notifications
ps: خبرتیاوې
ur: اطلاعات

source: No notifications
ps: هیڅ خبرتیا نشته
ur: کوئی اطلاع نہیں

source: All notifications cleared
ps: ټولې خبرتیاوې پاکې شوې
ur: تمام اطلاعات صاف کر دی گئیں

source: Error clearing notifications
ps: د خبرتیاوو پاکولو کې تېروتنه
ur: اطلاعات صاف کرنے میں خرابی

source: Unknown time
ps: نامعلوم وخت
ur: نامعلوم وقت

source: Just now
ps: همدا اوس
ur: ابھی ابھی

source: day ago
ps: ورځ دمخه
ur: دن پہلے

source: days ago
ps: ورځې دمخه
ur: دن پہلے

source: hour ago
ps: ساعت دمخه
ur: گھنٹہ پہلے

source: hours ago
ps: ساعتونه دمخه
ur: گھنٹے پہلے

source: minute ago
ps: دقیقه دمخه
ur: منٹ پہلے

source: minutes ago
ps: دقیقې دمخه
ur: منٹ پہلے

source: Start Journey
ps: سفر پیل کړئ
ur: سفر شروع کریں

# areYouSureStartJourney
source: Are you sure you want to start this journey?
ps: ایا تاسو واقعیا دا سفر پیل کول غواړئ؟
ur: کیا آپ واقعی یہ سفر شروع کرنا چاہتے ہیں؟

source: Journey started successfully
ps: سفر په بریالیتوب سره پیل شو
ur: سفر کامیابی سے شروع ہو گیا

source: Error starting journey
ps: د سفر پیلولو کې تېروتنه
ur: سفر شروع کرنے میں خرابی

source: Complete Journey
ps: سفر بشپړ کړئ
ur: سفر مکمل کریں

# areYouSureCompleteJourney
source: Are you sure you want to complete this journey?
ps: ایا تاسو واقعیا دا سفر بشپړول غواړئ؟
ur: کیا آپ واقعی یہ سفر مکمل کرنا چاہتے ہیں؟

source: Journey completed successfully
ps: سفر په بریالیتوب سره بشپړ شو
ur: سفر کامیابی سے مکمل ہو گیا

source: Error completing journey
ps: د سفر بشپړولو کې تېروتنه
ur: سفر مکمل کرنے میں خرابی

source: Trip Details
ps: د سفر جزیات
ur: سفر کی تفصیلات

source: Route Information
ps: د لارې معلومات
ur: راستے کی معلومات

source: Pickup Date
ps: د راټولولو نیټه
ur: پک اپ کی تاریخ

# pleaseEnterValidFareAmount
source: Please enter a valid fare amount
ps: مهرباني وکړئ د کرایې د صحیح مقدار داخل کړئ
ur: براہ کرم درست کرایہ کی رقم درج کریں

source: Refresh
ps: تازه کړئ
ur: تازہ کریں

source: View Route on Map
ps: په نقشه کې لاره وګورئ
ur: نقشے پر راستہ دیکھیں

source: Live Tracking
ps: ژوندی تعقیب
ur: لائیو ٹریکنگ

source: Destination
ps: منزل
ur: منزل

source: Driver Location
ps: د چلوونکي ځای
ur: ڈرائیور کا مقام

source: Error loading map
ps: د نقشې د پورته کولو کې تېروتنه
ur: نقشہ لوڈ کرنے میں خرابی

source: Waiting for driver location...
ps: د چلوونکي د ځای انتظار...
ur: ڈرائیور کے مقام کا انتظار...

source: No address provided
ps: هیڅ پته نه ده ورکړل شوې
ur: کوئی پتہ فراہم نہیں کیا گیا

# locationNotFound
source: Location not found for this address
ps: د دې پتې لپاره ځای ونه موندل شو
ur: اس پتے کے لیے مقام نہیں ملا

source: Error finding location
ps: د ځای موندلو کې تېروتنه
ur: مقام تلاش کرنے میں خرابی

source: Go Back
ps: بیرته لاړ شئ
ur: واپس جائیں

source: Choose Location on Map
ps: په نقشه کې ځای وټاکئ
ur: نقشے پر مقام منتخب کریں

source: Unable to load map
ps: نقشه پورته نشو کولی
ur: نقشہ لوڈ نہیں ہو سکا

# tapMapToSelectLocation
source: Tap on the map to select a location
ps: د ځای د انتخاب لپاره نقشه باندې وټاکئ
ur: مقام منتخب کرنے کے لیے نقشے پر ٹیپ کریں
