Repository: AmnaAshraf-2/fyp-1
Catalog: lib/l10n/app_*.arb
Languages: ps, ur

source: Uploading audio note...
ps: د غږ یادښت پورته کېږي...
ur: آڈیو نوٹ اپ لوڈ ہو رہا ہے...

source: Audio note uploaded successfully!
ps: د غږ یادښت په بریالیتوب سره پورته شو!
ur: آڈیو نوٹ کامیابی سے اپ لوڈ ہو گیا!

# errorUploadingAudio
source: Error uploading audio: {error}
ps: د غږ د پورته کولو تېروتنه: {error}
ur: آڈیو اپ لوڈ کرنے میں خرابی: {error}

source: Upload
ps: پورته کړئ
ur: اپ لوڈ

source: Audio note attached
ps: د غږ یادښت نښلول شوی
ur: آڈیو نوٹ منسلک

source: Remove
ps: لرې کړئ
ur: ہٹائیں

source: Tap to play customer audio note
ps: د پیرودونکي د غږ یادښت د پلې کولو لپاره ټاپ وکړئ
ur: کسٹمر کا آڈیو نوٹ چلانے کے لیے ٹیپ کریں

source: Pause
ps: درول
ur: روکیں

source: Play
ps: پلې کړئ
ur: چلائیں

# errorPlayingAudio
source: Error playing audio: {error}
ps: د غږ د پلې کولو تېروتنه: {error}
ur: آڈیو چلانے میں خرابی: {error}

source: No completed bookings yet
ps: تر اوسه هیڅ بشپړ بکینګونه نشته
ur: ابھی تک کوئی مکمل بکنگز نہیں

# completedBookingHistoryWillAppearHere
source: Your completed booking history will appear here
ps: ستاسو د بشپړ بکینګونو تاریخ دلته به ښکاره شي
ur: آپ کی مکمل بکنگ کی تاریخ یہاں ظاہر ہوگی

source: Delivered
ps: سپارل شوی
ur: ڈیلیور شدہ

source: Customer ID
ps: پیرودونکی ID
ur: کسٹمر ID

source: Delivered At
ps: سپارل شو
ur: ڈیلیور کیا گیا

source: Enterprise profile and settings will appear here
ps: د سازمان پروفایل او تنظیمات دلته به ښکاره شي
ur: انٹرپرائز پروفائل اور ترتیبات یہاں ظاہر ہوں گی

source: Loading...
ps: پورته کېږي...
ur: لوڈ ہو رہا ہے...

# noVehiclesFoundForSearch
source: No vehicles found
ps: هیڅ موټر ونه موندل شول
ur: کوئی گاڑی نہیں ملی

# searchVehiclesBy
source: Search vehicles by make, registration, type, or color...
ps: موټرونه د جوړونکي، ثبت، ډول، یا رنګ له لارې وپلټئ...
ur: گاڑیوں کو بنانے، رجسٹریشن، قسم، یا رنگ سے تلاش کریں...

# vehicleStatusChangedTo
source: Vehicle status changed to {status}
ps: د موټر حالت {status} ته بدل شو
ur: گاڑی کی حیثیت {status} میں تبدیل ہو گئی

source: Error updating vehicle status:
ps: د موټر د حالت تازه کولو تېروتنه:
ur: گاڑی کی حیثیت اپ ڈیٹ کرنے میں خرابی:

# driverCancelledRequest
source: Driver cancelled the request
ps: چلوونکي غوښتنه لغوه کړه
ur: ڈرائیور نے درخواست منسوخ کر دی

# driverHasStartedJourney
source: Driver has started the journey
ps: چلوونکي سفر پیل کړ
ur: ڈرائیور نے سفر شروع کر دیا

source: Trips
ps: سفرونه
ur: سفر

source: Revenue
ps: عایدات
ur: آمدنی

source: Commission
ps: کمیسیون
ur: کمیشن

source: Loading earnings...
ps: عایدات پورته کېږي...
ur: آمدنی لوڈ ہو رہی ہے...

# earningsWillAppearAfterTrips
source: Your earnings will appear here after completing trips
ps: ستاسو عایدات د سفرونو بشپړولو وروسته دلته به ښکاره شي
ur: سفر مکمل کرنے کے بعد آپ کی آمدنی یہاں ظاہر ہوگی

source: Trip
ps: سفر
ur: سفر

source: Customer phone number not available
ps: د پیرودونکي تلیفون شمیره شتون نلري
ur: کسٹمر کا فون نمبر دستیاب نہیں

source: Error calling customer:
ps: د پیرودونکي د کال کولو تېروتنه:
ur: کسٹمر کو کال کرنے میں خرابی:

source: No active trip
ps: هیڅ فعال سفر نشته
ur: کوئی فعال سفر نہیں

# startJourneyFromUpcomingTrips
source: Start a journey from Upcoming Trips
ps: د راتلونکو سفرونو څخه سفر پیل کړئ
ur: آنے والے سفر سے سفر شروع کریں

source: Journey In Progress
ps: سفر روان دی
ur: سفر جاری ہے

source: Started:
ps: پیل شو:
ur: شروع کیا:

source: Sender Phone
ps: د لیږونکي تلیفون
ur: بھیجنے والے کا فون

source: Receiver Phone
ps: د ترلاسه کوونکي تلیفون
ur: وصول کنندہ کا فون

source: View Directions on Map
ps: په نقشه کې لارښوونې وګورئ
ur: نقشے پر ہدایات دیکھیں

source: Your cargo has been delivered successfully
ps: ستاسو کارګو په بریالیتوب سره سپارل شو
ur: آپ کا کارگو کامیابی سے ڈیلیور کر دیا گیا

# pleaseWaitForAllDriversToCompleteJourney
source: Please wait for all drivers to complete their journey before marking as delivered.
ps: مهرباني وکړئ د ټولو چلوونکو د سفر بشپړیدو انتظار وکړئ مخکې له دې چې تاسو دا د سپارلو په توګه نښه کړئ.
ur: براہ کرم تمام ڈرائیورز کے سفر مکمل ہونے کا انتظار کریں اس سے پہلے کہ آپ اسے ڈیلیورڈ کے طور پر نشان زد کریں۔

# allDriversHaveCompletedJourney
source: All drivers have completed the journey
ps: ټول چلوونکو سفر بشپړ کړی دی
ur: تمام ڈرائیورز نے سفر مکمل کر لیا ہے

# statusAccepted
source: Accepted
ps: ومنل شوی
ur: قبول شدہ

# statusDispatched
source: Dispatched
ps: لیږل شوی
ur: بھیجا گیا

# statusInProgress
source: In Progress
ps: پرمختګ کې
ur: جاری ہے

# contactEnterprise
source: Enterprise
ps: سازمان
ur: ادارہ

# pickupLabel
source: Pickup
ps: رااخیستل
ur: اٹھانے

# fareLabel
source: Fare
ps: کرایه
ur: کرایہ

# enterpriseContactNotAvailable
source: Enterprise contact number not available
ps: د سازمان د اړیکو شمیره شتون نلري
ur: ادارہ کا رابطہ نمبر دستیاب نہیں

source: Error contacting enterprise
ps: د سازمان سره اړیکه کولو کې تېروتنه
ur: ادارہ سے رابطہ کرنے میں خرابی

source: Error cancelling request
ps: د غوښتنې لغوه کولو کې تېروتنه
ur: درخواست منسوخ کرنے میں خرابی

source: Notification
ps: خبرتیا
ur: اطلاع

source: Driver Details
ps: د چلوونکي تفصیلات
ur: ڈرائیور کی تفصیلات

source: Plate Number
ps: د پلیټ شمیره
ur: پلیٹ نمبر

# allDriversStartedCanMarkDispatched
source: All drivers have started journey for {loadName}. You can now mark it as dispatched.
ps: د {loadName} لپاره ټول چلوونکو سفر پیل کړی دی. تاسو اوس کولی شئ دا د لیږلو په توګه نښه کړئ.
ur: {loadName} کے لیے تمام ڈرائیورز نے سفر شروع کر دیا ہے۔ آپ اب اسے بھیجے گئے کے طور پر نشان زد کر سکتے ہیں۔

# cargoInTransit
source: Your cargo is now in transit
ps: ستاسو کارګو اوس د لیږد کې دی
ur: آپ کا کارگو اب ٹرانزٹ میں ہے

# driverAcceptedAssignment
source: {driverName} accepted assignment for {loadName}
ps: {driverName} د {loadName} لپاره دنده ومنله
ur: {driverName} نے {loadName} کے لیے تفویض قبول کر لی

# driverRejectedAssignment
source: {driverName} rejected assignment for {loadName}
ps: {driverName} د {loadName} لپاره دنده رد کړه
ur: {driverName} نے {loadName} کے لیے تفویض مسترد کر دی

# allDriversVehiclesAssignedReady
source: All drivers and vehicles have been assigned and accepted for {loadName}. Your booking is ready!
ps: د {loadName} لپاره ټول چلوونکي او موټرونه تخصیص او منل شوي دي. ستاسو بکینګ چمتو دی!
ur: {loadName} کے لیے تمام ڈرائیورز اور گاڑیاں تفویض اور قبول کر لی گئی ہیں۔ آپ کی بکنگ تیار ہے!
