Repository: AmnaAshraf-2/fyp-1
Catalog: lib/l10n/app_*.arb
Languages: ps, ur

# waitForAddressOrConfirm
source: Please wait for address to load, or tap Confirm anyway to use coordinates
ps: مهرباني وکړئ د پتې د پورته کیدو انتظار وکړئ، یا د کوآرډینیټونو د کارولو لپاره تصدیق باندې وټاکئ
ur: براہ کرم پتہ لوڈ ہونے کا انتظار کریں، یا کوآرڈینیٹس استعمال کرنے کے لیے تصدیق پر ٹیپ کریں

source: Confirm
ps: تصدیق کړئ
ur: تصدیق کریں

source: Selected Location
ps: غوره شوی ځای
ur: منتخب شدہ مقام

source: Loading address...
ps: پته پورته کېږي...
ur: پتہ لوڈ ہو رہا ہے...

source: Coordinates
ps: کوآرډینیټونه
ur: کوآرڈینیٹس

# couldNotGetAddress
source: Could not get address for this location
ps: د دې ځای لپاره پته نشو کولی ترلاسه کړو
ur: اس مقام کے لیے پتہ نہیں مل سکا

# mapLoadingTimeout
source: Map is taking longer than expected to load. Please check your internet connection and Google Maps API key.
ps: نقشه د توقع څخه ډیر وخت نیسي چې پورته شي. مهرباني وکړئ خپل انټرنیټ اړیکه او Google Maps API key وګورئ.
ur: نقشہ لوڈ ہونے میں توقع سے زیادہ وقت لگ رہا ہے۔ براہ کرم اپنا انٹرنیٹ کنکشن اور Google Maps API key چیک کریں۔

source: Route Map
ps: د لارې نقشه
ur: راستے کا نقشہ

source: Route
ps: لاره
ur: راستہ

source: Pickup
ps: رااخیستل
ur: پک اپ

source: Direct Enterprise Offer
ps: مستقیم سازمان وړاندیز
ur: براہ راست ادارہ کی پیشکش

source: Driver Offer
ps: د چلوونکي وړاندیز
ur: ڈرائیور کی پیشکش

source: Enterprise User
ps: د سازمان کارن
ur: ادارہ کا صارف

source: Key Metrics
ps: کلیدي معیارونه
ur: اہم پیمائشیں

source: Total Vehicles
ps: ټول موټرونه
ur: کل گاڑیاں

source: Total Drivers
ps: ټول چلوونکي
ur: کل ڈرائیور

source: Active Bookings
ps: فعال بکینګونه
ur: فعال بکنگز

source: Pending Offers
ps: پاتې وړاندیزونه
ur: زیر التواء پیشکشیں

source: Bookings
ps: بکینګونه
ur: بکنگز

source: View active bookings
ps: فعال بکینګونه وګورئ
ur: فعال بکنگز دیکھیں

# newTab
source: New
ps: نوی
ur: نیا

source: Active
ps: فعال
ur: فعال

source: Pending
ps: پاتې
ur: زیر التواء

# activeBookingsTitle
source: Active Bookings
ps: فعال بکینګونه
ur: فعال بکنگز

# activeBookingsSubtitle
source: Currently active bookings will appear here
ps: اوسنی فعال بکینګونه دلته به ښکاره شي
ur: فی الحال فعال بکنگز یہاں ظاہر ہوں گی

# pendingBookingsTitle
source: Pending Bookings
ps: پاتې بکینګونه
ur: زیر التواء بکنگز

# pendingBookingsSubtitle
source: Pending booking confirmations will appear here
ps: پاتې بکینګ تصدیقونه دلته به ښکاره شي
ur: زیر التواء بکنگ کی تصدیقات یہاں ظاہر ہوں گی

source: Profile & Settings
ps: پروفایل او تنظیمات
ur: پروفائل اور ترتیبات

source: CEO
ps: سی ای او
ur: سی ای او

source: Managing Director
ps: د مدیریت مدیر
ur: منیجنگ ڈائریکٹر

source: Director
ps: مدیر
ur: ڈائریکٹر

source: Shareholder
ps: وړونکی
ur: حصہ دار

source: Partner
ps: شریک
ur: شراکت دار

source: Other
ps: نور
ur: دیگر

source: Sole Proprietorship
ps: واحد مالکیت
ur: واحد مالکیت

source: Partnership
ps: شریکول
ur: شراکت

source: Government Entity
ps: د حکومت اداره
ur: حکومتی ادارہ

source: years
ps: کلونه
ur: سال

source: Private Limited Company
ps: خصوصي محدود شرکت
ur: پرائیویٹ لمیٹڈ کمپنی

source: Public Limited Company
ps: عمومي محدود شرکت
ur: پبلک لمیٹڈ کمپنی

source: Non-Profit Organization
ps: غیر انتفاعي سازمان
ur: غیر منفعتی تنظیم

source: Offer sent to customer
ps: وړاندیز پیرودونکي ته واستول شو
ur: پیشکش کسٹمر کو بھیج دی گئی

source: Guest User
ps: مېلمه کارن
ur: مہمان صارف

source: Book Your Cargo
ps: خپل کارګو بک کړئ
ur: اپنا کارگو بک کریں

source: Track Your Cargo
ps: خپل کارګو تعقیب کړئ
ur: اپنا کارگو ٹریک کریں

source: Scheduled Bookings
ps: پلان شوي بکینګونه
ur: شیڈول شدہ بکنگز

# cargoDetailsSection
source: Cargo Details
ps: د کارګو جزئیات
ur: کارگو کی تفصیلات

# weightVehicleSection
source: Weight & Vehicle
ps: وزن او موټر
ur: وزن اور گاڑی

# contactDetailsSection
source: Contact Details
ps: د اړیکو جزئیات
ur: رابطے کی تفصیلات

# locationsSection
source: Locations
ps: ځایونه
ur: مقامات

# scheduleSection
source: Schedule
ps: مهال ویش
ur: شیڈول

# fareInsuranceSection
source: Fare & Insurance
ps: کرایه او بیمه
ur: کرایہ اور انشورنس

source: Capacity Status
ps: د ظرفیت حالت
ur: گنجائش کی حیثیت

# phoneNumberExample
source: e.g., 03001234567
ps: د بېلګې په توګه: 03001234567
ur: مثال: 03001234567

# phoneNumberFormat
source: Format: 03XX-XXXXXXX or 0XXX-XXXXXXX
ps: فارمیټ: 03XX-XXXXXXX یا 0XXX-XXXXXXX
ur: فارمیٹ: 03XX-XXXXXXX یا 0XXX-XXXXXXX

source: Select from contacts
ps: د اړیکو څخه وټاکئ
ur: رابطوں سے منتخب کریں

# phoneNumberRequired
source: Phone number is required
ps: د تلیفون شمیره اړینه ده
ur: فون نمبر درکار ہے

# phoneNumberOnlyDigits
source: Phone number must contain only digits
ps: د تلیفون شمیره باید یوازې شمیرې ولري
ur: فون نمبر میں صرف ہندسے ہونے چاہئیں

source: Phone number must start with 0
ps: د تلیفون شمیره باید د 0 سره پیل شي
ur: فون نمبر 0 سے شروع ہونا چاہیے

# phoneNumberMustBe11Digits
source: Phone number must be exactly 11 digits (e.g., 03001234567)
ps: د تلیفون شمیره باید دقیقاً 11 شمیرې ولري (د بېلګې په توګه: 03001234567)
ur: فون نمبر بالکل 11 ہندسے کا ہونا چاہیے (مثال: 03001234567)

# invalidMobilePrefix03XX
source: Invalid mobile number prefix. Must be 03XX (e.g., 0300-0399)
ps: ناسم موبایل شمیره مخکښ. باید 03XX وي (د بېلګې په توګه: 0300-0399)
ur: غلط موبائل نمبر سابقہ۔ 03XX ہونا چاہیے (مثال: 0300-0399)

# invalidMobilePrefix04XX
source: Invalid mobile number prefix. Must be 04XX (e.g., 0400-0499)
ps: ناسم موبایل شمیره مخکښ. باید 04XX وي (د بېلګې په توګه: 0400-0499)
ur: غلط موبائل نمبر سابقہ۔ 04XX ہونا چاہیے (مثال: 0400-0499)

# invalidMobilePrefix05XX
source: Invalid mobile number prefix. Must be 05XX (e.g., 0500-0599)
ps: ناسم موبایل شمیره مخکښ. باید 05XX وي (د بېلګې په توګه: 0500-0599)
ur: غلط موبائل نمبر سابقہ۔ 05XX ہونا چاہیے (مثال: 0500-0599)

# invalidPhoneFormat
source: Invalid phone number format. Must start with 03, 04, or 05 for mobile numbers
ps: ناسم د تلیفون شمیره فارمیټ. د موبایل شمیرو لپاره باید د 03، 04، یا 05 سره پیل شي
ur: غلط فون نمبر فارمیٹ۔ موبائل نمبروں کے لیے 03، 04، یا 05 سے شروع ہونا چاہیے

# invalidPhoneFormatAfterPrefix
source: Invalid phone number format. After prefix, must have 7 digits
ps: ناسم د تلیفون شمیره فارمیټ. د مخکښ وروسته باید 7 شمیرې ولري
ur: غلط فون نمبر فارمیٹ۔ سابقہ کے بعد 7 ہندسے ہونے چاہئیں

# phoneNumberAllSameDigits
source: Phone number appears to be invalid (all digits are the same)
ps: د تلیفون شمیره ناسمه ښکاري (ټولې شمیرې یو شان دي)
ur: فون نمبر غلط لگ رہا ہے (تمام ہندسے ایک جیسے ہیں)

# phoneNumberInvalid
source: Phone number appears to be invalid
ps: د تلیفون شمیره ناسمه ښکاري
ur: فون نمبر غلط لگ رہا ہے

source: Tap to choose location
ps: د ځای د ټاکلو لپاره ټپ وکړئ
ur: مقام منتخب کرنے کے لیے ٹیپ کریں

source: Pickup Date: Not Selected
ps: د راټولولو نیټه: نه ده ټاکل شوې
ur: پک اپ کی تاریخ: منتخب نہیں

source: Select Date
ps: نیټه وټاکئ
ur: تاریخ منتخب کریں

# pleaseEnterValidWeight
source: Please enter a valid weight
ps: مهرباني وکړئ د وزن درست ارزښت ولیکئ
ur: براہ کرم درست وزن درج کریں

source: Weight exceeds capacity!
ps: وزن د ظرفیت څخه زیات دی!
ur: وزن گنجائش سے زیادہ ہے!

# requiredVehicles
source: Required
ps: اړین
ur: درکار

# currentVehicles
source: Current
ps: اوسنی
ur: موجودہ

# weightExceedsSingleVehicle
source: Weight exceeds single vehicle capacity. Quantity automatically set to {requiredVehicles} vehicle(s)
ps: وزن د یو موټر ظرفیت څخه زیات دی. مقدار په اتوماتیک ډول {requiredVehicles} موټر(ونو) ته تنظیم شو
ur: وزن ایک گاڑی کی گنجائش سے زیادہ ہے۔ مقدار خود بخود {requiredVehicles} گاڑی(وں) پر سیٹ کر دی گئی

# weightExceedsCapacityAutoUpdate
source: Weight exceeds capacity! Need {requiredVehicles} vehicle(s) but only {quantity} selected. Quantity will be updated automatically.
ps: وزن د ظرفیت څخه زیات دی! {requiredVehicles} موټر(ونه) اړین دي مګر یوازې {quantity} ټاکل شوي. مقدار به په اتوماتیک ډول تازه شي.
ur: وزن گنجائش سے زیادہ ہے! {requiredVehicles} گاڑی(وں) کی ضرورت ہے لیکن صرف {quantity} منتخب کی گئی۔ مقدار خود بخود اپ ڈیٹ ہو جائے گی۔

# pleaseEnterValidQuantity
source: Please enter a valid quantity (minimum 1)
ps: مهرباني وکړئ د مقدار درست ارزښت ولیکئ (لږترلږه 1)
ur: براہ کرم درست مقدار درج کریں (کم از کم 1)

source: Fare
ps: کرایه
ur: کرایہ

source: Please enter fare amount
ps: مهرباني وکړئ د کرایې مقدار ولیکئ
ur: براہ کرم کرایہ کی رقم درج کریں

source: Please enter valid amount
ps: مهرباني وکړئ د مقدار درست ارزښت ولیکئ
ur: براہ کرم درست رقم درج کریں

source: Fare cannot be zero
ps: کرایه نشي کولی صفر وي
ur: کرایہ صفر نہیں ہو سکتا

# fareBelowMinimum
source: Fare cannot be below the minimum suggested amount of Rs {minimumFare}
ps: کرایه نشي کولی د کم از کم وړاندیز شوي مقدار څخه لږ وي: روپۍ {minimumFare}
ur: کرایہ کم از کم تجویز کردہ رقم سے کم نہیں ہو سکتا: روپے {minimumFare}

source: Contacts permission denied
ps: د اړیکو اجازه رد شوه
ur: رابطوں کی اجازت مسترد کر دی گئی

source: Exceeds capacity! Need
ps: د ظرفیت څخه زیات! اړتیا
ur: گنجائش سے زیادہ! ضرورت

source: vehicle(s)
ps: موټر(ونه)
ur: گاڑی(وں)

source: kg
ps: کیلو
ur: کلوگرام

source: tons
ps: ټن
ur: ٹن

# approachingCapacityLimit
source: Approaching capacity limit. Total capacity
ps: د ظرفیت حد ته نږدې. ټول ظرفیت
ur: گنجائش کی حد کے قریب۔ کل گنجائش

source: Total capacity
ps: ټول ظرفیت
ur: کل گنجائش

source: remaining
ps: پاتې
ur: باقی

source: Maximum capacity
ps: د حداکثر ظرفیت
ur: زیادہ سے زیادہ گنجائش

source: No Response Received
ps: کومه ځواب نه دی ترلاسه شوی
ur: کوئی جواب موصول نہیں ہوا

# noDriversResponded
source: No drivers or enterprises have responded to your request in the last 2 minutes.
ps: په تیرو 2 دقیقو کې هیڅ چلوونکی یا سوداګرۍ ستاسو غوښتنې ته ځواب نه دی ورکړی.
ur: پچھلے 2 منٹ میں کسی ڈرائیور یا انٹرپرائز نے آپ کے درخواست کا جواب نہیں دیا۔

# increaseFare
source: You can increase the fare to attract more responses:
ps: تاسو کولی شئ د زیاتو ځوابونو لپاره کرایه لوړه کړئ:
ur: آپ زیادہ ردعمل حاصل کرنے کے لیے کرایہ بڑھا سکتے ہیں:

source: New Fare Amount
ps: نوی کرایه مقدار
ur: نیا کرایہ کی رقم

source: Update Fare & Resend
ps: کرایه تازه کړئ او بیا واستوئ
ur: کرایہ اپ ڈیٹ کریں اور دوبارہ بھیجیں

# requestResent
source: Request resent with updated fare: Rs {fare}
ps: غوښتنه د تازه شوې کرایې سره بیا واستول شوه: روپۍ {fare}
ur: درخواست اپ ڈیٹ شدہ کرایہ کے ساتھ دوبارہ بھیجی گئی: روپے {fare}

# errorResending
source: Error resending request
ps: د غوښتنې بیا لیږلو کې تېروتنه
ur: درخواست دوبارہ بھیجنے میں خرابی

# errorCancelling
source: Error cancelling request
ps: د غوښتنې لغوه کولو کې تېروتنه
ur: درخواست منسوخ کرنے میں خرابی

source: Error loading data:
ps: د معلوماتو د پورته کولو تېروتنه:
ur: ڈیٹا لوڈ کرنے میں خرابی:

source: Error finding new driver:
ps: د نوی چلوونکی موندلو کې تېروتنه:
ur: نیا ڈرائیور تلاش کرنے میں خرابی:

# customerCancelledRequest
source: Customer cancelled the request
ps: پیرودونکي غوښتنه لغوه کړه
ur: کسٹمر نے درخواست منسوخ کر دی

# requestAcceptedByDriver
source: Your request has been accepted by a driver!
ps: ستاسو غوښتنه د یو چلوونکی لخوا ومنل شوه!
ur: آپ کی درخواست ایک ڈرائیور نے قبول کر لی ہے!

# requestAcceptedByEnterprise
source: Your request has been accepted by an enterprise!
ps: ستاسو غوښتنه د یو سوداګرۍ لخوا ومنل شوه!
ur: آپ کی درخواست ایک انٹرپرائز نے قبول کر لی ہے!

source: View Bookings
ps: بکنګونه وګورئ
ur: بکنگز دیکھیں

source: ACCEPTED
ps: ومنل شوی
ur: قبول شدہ

source: COUNTER
ps: کاونټر
ur: کاؤنٹر

source: Unknown
ps: نامعلوم
ur: نامعلوم

source: Load Details
ps: د بار تفصیلات
ur: لوڈ کی تفصیلات

source: Contact Details
ps: د اړیکو تفصیلات
ur: رابطے کی تفصیلات

source: Schedule & Fare
ps: مهال او کرایه
ur: شیڈول اور کرایہ

source: Not specified
ps: مشخص شوی نه دی
ur: متعلق نہیں

source: Select Request Type
ps: د غوښتنې ډول وټاکئ
ur: درخواست کی قسم منتخب کریں

# youNeedVehicles
source: You need {quantity} vehicles. Would you like to send this request to individual drivers or enterprises?
ps: تاسو ته {quantity} موټر(ونه) اړین دي. ایا تاسو غواړئ دا غوښتنه انفرادي چلوونکو یا سوداګریو ته واستوئ؟
ur: آپ کو {quantity} گاڑیوں کی ضرورت ہے۔ کیا آپ یہ درخواست انفرادی ڈرائیورز یا انٹرپرائزز کو بھیجنا چاہتے ہیں؟

source: Send to Drivers
ps: چلوونکو ته واستوئ
ur: ڈرائیورز کو بھیجیں

source: Send to Enterprise
ps: سوداګرۍ ته واستوئ
ur: انٹرپرائز کو بھیجیں

# pleaseEnsureLocations
source: Please ensure both pickup and destination locations are specified
ps: مهرباني وکړئ ډاډه کړئ چې د پک اپ او منزل دواړه موقعیتونه مشخص شوي
ur: براہ کرم یقینی بنائیں کہ پک اپ اور منزل دونوں مقامات متعین ہیں

# requestSentToDrivers
source: Request sent to drivers with {vehicleType} vehicles
ps: غوښتنه د {vehicleType} موټر(ونو) سره چلوونکو ته واستول شوه
ur: {vehicleType} گاڑیوں والے ڈرائیورز کو درخواست بھیجی گئی

# requestSentToEnterprises
source: Request sent to enterprises with {vehicleType} vehicles
ps: غوښتنه د {vehicleType} موټر(ونو) سره سوداګریو ته واستول شوه
ur: {vehicleType} گاڑیوں والے انٹرپرائزز کو درخواست بھیجی گئی

# requestSentToBoth
source: Request sent to drivers and enterprises with {vehicleType} vehicles
ps: غوښتنه د {vehicleType} موټر(ونو) سره چلوونکو او سوداګریو ته واستول شوه
ur: {vehicleType} گاڑیوں والے ڈرائیورز اور انٹرپرائزز کو درخواست بھیجی گئی

source: Drivers
ps: چلوونکي
ur: ڈرائیور

# manageLogisticsOperations
source: Manage your logistics operations efficiently
ps: ستاسو د لاجستیک عملیاتو په اغیزمنه توګه اداره کړئ
ur: اپنے لاجسٹکس آپریشنز کو موثر طریقے سے منظم کریں

source: View new offers
ps: نوې وړاندیزونه وګورئ
ur: نئی پیشکشیں دیکھیں

source: User not logged in
ps: کارن ننوتلی نه دی
ur: صارف لاگ ان نہیں ہے

# errorSwitchingRole
source: Error switching role: {error}
ps: د رول بدلولو کې تېروتنه: {error}
ur: کردار تبدیل کرنے میں خرابی: {error}

source: Profile - Coming Soon
ps: پروفایل - ژر راځي
ur: پروفائل - جلد آرہا ہے

source: Settings - Coming Soon
ps: تنظیمات - ژر راځي
ur: ترتیبات - جلد آرہا ہے

source: Support - Coming Soon
ps: ملاتړ - ژر راځي
ur: سپورٹ - جلد آرہا ہے

source: About - Coming Soon
ps: په اړه - ژر راځي
ur: کے بارے میں - جلد آرہا ہے

# searchForLocation
source: Search for a location...
ps: د موقعیت لټون...
ur: کسی مقام کی تلاش کریں...

source: Nearest Places
ps: نږدې ځایونه
ur: قریبی مقامات

source: Search Results
ps: د لټون پایلې
ur: تلاش کے نتائج

# startTypingToSearch
source: Start typing to search for locations
ps: د موقعیتونو لټون لپاره ټایپ کول پیل کړئ
ur: مقامات تلاش کرنے کے لیے ٹائپ کرنا شروع کریں

# noSuggestionsFound
source: No suggestions found. Try "Choose on Map" or type a full address.
ps: هیڅ وړاندیزونه ونه موندل شول. "په نقشه کې غوره کړئ" وکاروئ یا بشپړ پته ولیکئ.
ur: کوئی تجاویز نہیں ملیں۔ "نقشے پر منتخب کریں" استعمال کریں یا مکمل پتہ ٹائپ کریں۔

# tapToUseAddress
source: Tap to use this address
ps: د دې پتې کارولو لپاره ټایپ کړئ
ur: اس پتے کو استعمال کرنے کے لیے ٹیپ کریں

# errorSearchingPlaces
source: Error searching places: {error}
ps: د موقعیتونو لټون کې تېروتنه: {error}
ur: مقامات تلاش کرنے میں خرابی: {error}

# couldNotGetPlaceDetails
source: Could not get place details. Please use "Choose on Map" instead.
ps: د موقعیت جزئیات ترلاسه نشول. مهرباني وکړئ "په نقشه کې غوره کړئ" وکاروئ.
ur: مقام کی تفصیلات حاصل نہیں ہو سکیں۔ براہ کرم "نقشے پر منتخب کریں" استعمال کریں۔

# errorGettingPlaceDetails
source: Error getting place details: {error}
ps: د موقعیت جزئیات ترلاسه کولو کې تېروتنه: {error}
ur: مقام کی تفصیلات حاصل کرنے میں خرابی: {error}

# pleaseSelectOrEnterLocation
source: Please select or enter a location
ps: مهرباني وکړئ موقعیت غوره کړئ یا ولیکئ
ur: براہ کرم کوئی مقام منتخب کریں یا درج کریں

source: Notification Preferences
ps: د خبرتیا غوره توبې
ur: اطلاعات کی ترجیحات

# notificationPreferencesDesc
source: Choose how you want to receive notifications
ps: غوره کړئ چې تاسو غواړئ خبرتیاوې څنګه ترلاسه کړئ
ur: منتخب کریں کہ آپ اطلاعات کیسے حاصل کرنا چاہتے ہیں

source: Email Notifications
ps: د بریښنالیک خبرتیاوې
ur: ای میل اطلاعات

# emailNotificationsDesc
source: Receive notifications via email
ps: د بریښنالیک له لارې خبرتیاوې ترلاسه کړئ
ur: ای میل کے ذریعے اطلاعات حاصل کریں

source: SMS Notifications
ps: د SMS خبرتیاوې
ur: ایس ایم ایس اطلاعات

# smsNotificationsDesc
source: Receive notifications via SMS
ps: د SMS له لارې خبرتیاوې ترلاسه کړئ
ur: ایس ایم ایس کے ذریعے اطلاعات حاصل کریں

source: In-App Notifications
ps: په اپ کې خبرتیاوې
ur: ایپ میں اطلاعات

# inAppNotificationsDesc
source: Receive notifications within the app
ps: په اپ کې خبرتیاوې ترلاسه کړئ
ur: ایپ کے اندر اطلاعات حاصل کریں

# preferencesSaved
source: Notification preferences saved successfully
ps: د خبرتیا غوره توبې په بریالیتوب سره خوندي شوې
ur: اطلاعات کی ترجیحات کامیابی سے محفوظ ہو گئیں

# errorSavingPreferences
source: Error saving notification preferences
ps: د خبرتیا غوره توبې خوندي کولو کې تېروتنه
ur: اطلاعات کی ترجیحات محفوظ کرنے میں خرابی

source: Error loading preferences:
ps: د غوره توبو د پورته کولو تېروتنه:
ur: ترجیحات لوڈ کرنے میں خرابی:

source: New Assignments
ps: نوې دندې
ur: نئی تفویضات

source: No new assignments
ps: هیڅ نوې دندې نشته
ur: کوئی نئی تفویضات نہیں

source: Rejected
ps: رد شوی
ur: مسترد

source: From
ps: څخه
ur: سے

source: To
ps: ته
ur: تک

source: Vehicle
ps: موټر
ur: گاڑی

source: Assigned
ps: تخصیص شوی
ur: تفویض شدہ

source: Assignment accepted
ps: دنده ومنل شوه
ur: تفویض قبول کر لی گئی

source: Assignment rejected
ps: دنده رد شوه
ur: تفویض مسترد کر دی گئی

source: Error responding to assignment:
ps: د دندې ته ځواب ورکولو کې تېروتنه:
ur: تفویض کا جواب دینے میں خرابی:

source: Booking
ps: بکینګ
ur: بکنگ

source: N/A
ps: شتون نلري
ur: دستیاب نہیں

source: Enterprise Driver
ps: د سازمان چلوونکی
ur: انٹرپرائز ڈرائیور

source: Set Your Password
ps: خپل پټنوم ټاکئ
ur: اپنا پاس ورڈ سیٹ کریں

# welcomeSetSecurePassword
source: Welcome! Please set a secure password for your account.
ps: ښه راغلاست! مهرباني وکړئ د خپل حساب لپاره خوندي پټنوم ټاکئ.
ur: خوش آمدید! براہ کرم اپنے اکاؤنٹ کے لیے ایک محفوظ پاس ورڈ سیٹ کریں۔

# pleaseEnterPassword
source: Please enter a password
ps: مهرباني وکړئ پټنوم ولیکئ
ur: براہ کرم پاس ورڈ درج کریں

# pleaseConfirmPassword
source: Please confirm your password
ps: مهرباني وکړئ خپل پټنوم تصدیق کړئ
ur: براہ کرم اپنے پاس ورڈ کی تصدیق کریں

source: Enter your password
ps: خپل پټنوم ولیکئ
ur: اپنا پاس ورڈ درج کریں

source: Confirm your password
ps: خپل پټنوم تصدیق کړئ
ur: اپنے پاس ورڈ کی تصدیق کریں

source: Setting up...
ps: سیټ اپ کېږي...
ur: سیٹ اپ ہو رہا ہے...

source: Set Password
ps: پټنوم ټاکئ
ur: پاس ورڈ سیٹ کریں

source: Password set successfully!
ps: پټنوم په بریالیتوب سره ټاکل شو!
ur: پاس ورڈ کامیابی سے سیٹ ہو گیا!

# failedToSetPassword
source: Failed to set password. Please try again.
ps: د پټنوم د ټاکلو کې ناکامي. مهرباني وکړئ بیا هڅه وکړئ.
ur: پاس ورڈ سیٹ کرنے میں ناکامی۔ براہ کرم دوبارہ کوشش کریں۔

# passwordTooWeak
source: Password is too weak. Please choose a stronger password.
ps: پټنوم ډیر ضعیف دی. مهرباني وکړئ قوي پټنوم وټاکئ.
ur: پاس ورڈ بہت کمزور ہے۔ براہ کرم ایک مضبوط پاس ورڈ منتخب کریں۔

# sessionExpiredSetPassword
source: Session expired. Please log out and log in again, then set your password.
ps: غونډه پای ته رسېدلې. مهرباني وکړئ ووځئ او بیا ننوځئ، بیا خپل پټنوم ټاکئ.
ur: سیشن ختم ہو گیا۔ براہ کرم لاگ آؤٹ کریں اور دوبارہ لاگ ان کریں، پھر اپنا پاس ورڈ سیٹ کریں۔

# emailMismatch
source: Email mismatch. Please log in with the correct account.
ps: بریښنالیک سمون نلري. مهرباني وکړئ د سم حساب سره ننوځئ.
ur: ای میل میل نہیں کھاتی۔ براہ کرم صحیح اکاؤنٹ کے ساتھ لاگ ان کریں۔

source: Active Trips
ps: فعال سفرونه
ur: فعال سفر

source: No Active Trips
ps: هیڅ فعال سفرونه نشته
ur: کوئی فعال سفر نہیں

source: Dispatched bookings will appear here
ps: لیږل شوي بکینګونه دلته به ښکاره شي
ur: بھیجے گئے بکنگز یہاں ظاہر ہوں گی

source: In Progress
ps: پرمختګ کې
ur: جاری ہے

source: Dispatched
ps: لیږل شوی
ur: بھیجا گیا

source: Dispatched At
ps: لیږل شوی
ur: بھیجا گیا

source: Assigned Resources
ps: تخصیص شوي سرچینې
ur: تفویض شدہ وسائل

source: Mark as Delivered
ps: د سپارلو په توګه نښه کړئ
ur: ڈیلیور شدہ کے طور پر نشان زد کریں

# areYouSureMarkAsDelivered
source: Are you sure this booking has been delivered? The customer will be notified.
ps: ایا تاسو ډاډه یاست چې دا بکینګ سپارل شوی دی؟ پیرودونکی به خبر شي.
ur: کیا آپ یقینی ہیں کہ یہ بکنگ ڈیلیور ہو گئی ہے؟ کسٹمر کو مطلع کیا جائے گا۔

source: Booking marked as delivered successfully
ps: بکینګ په بریالیتوب سره د سپارلو په توګه نښه شو
ur: بکنگ کامیابی سے ڈیلیور شدہ کے طور پر نشان زد کی گئی

source: Error marking as delivered:
ps: د سپارلو په توګه نښه کولو کې تېروتنه:
ur: ڈیلیور شدہ کے طور پر نشان زد کرنے میں خرابی:

source: Error: Request ID not found
ps: تېروتنه: د غوښتنې شمیره ونه موندل شوه
ur: خرابی: درخواست آئی ڈی نہیں ملی

source: Request not found
ps: غوښتنه ونه موندل شوه
ur: درخواست نہیں ملی

source: your cargo
ps: ستاسو کارګو
ur: آپ کا کارگو

# yourBookingHasBeenDelivered
source: Your booking for "{loadName}" has been delivered
ps: ستاسو بکینګ "{loadName}" سپارل شوی دی
ur: آپ کی بکنگ "{loadName}" ڈیلیور ہو گئی ہے

# yourBookingHasBeenDispatched
source: Your booking for "{loadName}" has been dispatched and is on its way
ps: ستاسو بکینګ "{loadName}" لیږل شوې ده او په لار کې ده
ur: آپ کی بکنگ "{loadName}" بھیج دی گئی ہے اور راستے میں ہے

source: Booking has been dispatched
ps: بکینګ لیږل شوې ده
ur: بکنگ بھیج دی گئی ہے

source: Delivery completed for assigned booking
ps: د تخصیص شوي بکینګ لپاره سپارل بشپړ شو
ur: تفویض شدہ بکنگ کے لیے ڈیلیوری مکمل ہو گئی

source: Vehicle {number}
ps: موټر {number}
ur: گاڑی {number}

source: Inactive
ps: غیر فعال
ur: غیر فعال

# emailAlreadyRegisteredAsDriver
source: This email is already registered as an enterprise driver.
ps: دا بریښنالیک دمخه د سازمان چلوونکی په توګه ثبت شوی دی.
ur: یہ ای میل پہلے سے انٹرپرائز ڈرائیور کے طور پر رجسٹرڈ ہے۔

# emailAlreadyRegisteredDifferentRole
source: This email is already registered with a different role.
ps: دا بریښنالیک دمخه د مختلف رول سره ثبت شوی دی.
ur: یہ ای میل پہلے سے مختلف کردار کے ساتھ رجسٹرڈ ہے۔

# driverCanNowLoginToSetupAccount
source: Driver can now log in with their email to set up their account.
ps: چلوونکی اوس کولی شي د خپل بریښنالیک سره ننوځي او خپل حساب تنظیم کړي.
ur: ڈرائیور اب اپنے ای میل سے لاگ ان کر کے اپنا اکاؤنٹ سیٹ اپ کر سکتا ہے۔

# driverStatusChangedTo
source: Driver status changed to {status}
ps: د چلوونکي حالت {status} ته بدل شو
ur: ڈرائیور کی حیثیت {status} میں تبدیل ہو گئی

source: Error updating driver status:
ps: د چلوونکي د حالت تازه کولو تېروتنه:
ur: ڈرائیور کی حیثیت اپ ڈیٹ کرنے میں خرابی:

# searchDriversBy
source: Search drivers by name, phone, CNIC, or license...
ps: چلوونکي د نوم، تلیفون، CNIC، یا جواز له لارې وپلټئ...
ur: ڈرائیورز کو نام، فون، CNIC، یا لائسنس سے تلاش کریں...

# noDriversFoundForSearch
source: No drivers found
ps: هیڅ چلوونکي ونه موندل شول
ur: کوئی ڈرائیور نہیں ملا

# tryDifferentSearchTerm
source: Try a different search term
ps: مختلف پلټنې اصطلاح وازمویئ
ur: مختلف تلاش کی اصطلاح آزمائیں

source: Total Earnings
ps: ټول عایدات
ur: کل آمدنی

source: Average
ps: منځنی
ur: اوسط

source: No earnings yet
ps: تر اوسه هیڅ عایدات نشته
ur: ابھی تک کوئی آمدنی نہیں

# earningsWillAppearHere
source: Your earnings will appear here after completing bookings
ps: ستاسو عایدات د بکینګونو بشپړولو وروسته دلته به ښکاره شي
ur: بکنگز مکمل کرنے کے بعد آپ کی آمدنی یہاں ظاہر ہوگی

source: Earnings History
ps: د عایداتو تاریخ
ur: آمدنی کی تاریخ

source: Earnings
ps: عایدات
ur: آمدنی

source: Completed
ps: بشپړ شوی
ur: مکمل

source: New customer requests will appear here
ps: نوي پیرودونکو غوښتنې دلته به ښکاره شي
ur: نئے کسٹمر کے درخواستیں یہاں ظاہر ہوں گی

# counterOfferLabel
source: Counter offer:
ps: کاونټر وړاندیز:
ur: کاؤنٹر آفر:

source: Audio Note
ps: د غږ یادښت
ur: آڈیو نوٹ

source: Audio Note (Optional)
ps: د غږ یادښت (اختیاري)
ur: آڈیو نوٹ (اختیاری)

source: Record Audio Note
ps: د غږ یادښت ثبت کړئ
ur: آڈیو نوٹ ریکارڈ کریں

source: Stop Recording
ps: د ثبت کولو بندول
ur: ریکارڈنگ بند کریں

# failedToStartRecording
source: Failed to start recording. Please check microphone permissions.
ps: د ثبت کولو پیل کولو کې ناکامي. مهرباني وکړئ د مایکروفون اجازتونه وګورئ.
ur: ریکارڈنگ شروع کرنے میں ناکامی۔ براہ کرم مائیکروفون کی اجازتیں چیک کریں۔
